Updating Pandas DataFrame

In [49]:
import pandas as pd

data = {'first': ['Carl', 'Francis', 'Sam'],
        'last':  ['Po', 'Nguyen', 'Smith'],
        'age':   ['32', '45', '22'],
        'CH_count':[12, 14, 39]}
clients = pd.DataFrame(data)
clients

     first    last age  CH_count
0     Carl      Po  32        12
1  Francis  Nguyen  45        14
2      Sam   Smith  22        39

# Adding Rows

In [50]:
new_data = {'first': ['Sue', 'Boya'],
            'last':['Rankler', 'Maple'],
            'age':[93, 12],
            'CH_count':[22, 1]}

new_clients = pd.DataFrame(new_data)
new_clients

  first     last  age  CH_count
0   Sue  Rankler   93        22
1  Boya    Maple   12         1

## Using pd.concat() to append new rows to a Dataframe

In [51]:
clients = pd.concat([clients, new_clients], ignore_index=True)
clients

     first     last age  CH_count
0     Carl       Po  32        12
1  Francis   Nguyen  45        14
2      Sam    Smith  22        39
3      Sue  Rankler  93        22
4     Boya    Maple  12         1

## Setting specific value

In [52]:
clients.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   first     5 non-null      object
 1   last      5 non-null      object
 2   age       5 non-null      object
 3   CH_count  5 non-null      int64
dtypes: int64(1), object(3)
memory usage: 292.0+ bytes

In [53]:
clients.loc[1, 'first'] = 'Frankie'
clients

     first     last age  CH_count
0     Carl       Po  32        12
1  Frankie   Nguyen  45        14
2      Sam    Smith  22        39
3      Sue  Rankler  93        22
4     Boya    Maple  12         1

In [54]:
clients.loc[0:1, 'CH_count'] = -1      ## 1 is included, would be different if it was [0,1]
clients

     first     last age  CH_count
0     Carl       Po  32        -1
1  Frankie   Nguyen  45        -1
2      Sam    Smith  22        39
3      Sue  Rankler  93        22
4     Boya    Maple  12         1

## Math Operations

In [55]:
clients.CH_count + 1

0     0
1     0
2    40
3    23
4     2
Name: CH_count, dtype: int64

In [56]:
clients

     first     last age  CH_count
0     Carl       Po  32        -1
1  Frankie   Nguyen  45        -1
2      Sam    Smith  22        39
3      Sue  Rankler  93        22
4     Boya    Maple  12         1

In [57]:
clients.CH_count -= 3
clients

     first     last age  CH_count
0     Carl       Po  32        -4
1  Frankie   Nguyen  45        -4
2      Sam    Smith  22        36
3      Sue  Rankler  93        19
4     Boya    Maple  12        -2

## Replace

In [58]:
clients.replace(-4, 0)

     first     last age  CH_count
0     Carl       Po  32         0
1  Frankie   Nguyen  45         0
2      Sam    Smith  22        36
3      Sue  Rankler  93        19
4     Boya    Maple  12        -2